Catalogs/ЛБ_СлужебныеСтатусыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_СлужебныеСтатусыКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предупредить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Несостоятельный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗапретНаОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_СлужебныеСтатусыКлиентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Если Объект.Предупредить Тогда
		Элементы.ГруппаИнформация.Видимость = Истина;
	Иначе
		Элементы.ГруппаИнформация.Видимость = ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Информация = ТекущийОбъект.ДопИнформация.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДопИнформация = Новый ХранилищеЗначения(Информация);
КонецПроцедуры

&НаКлиенте
Процедура ПредупредитьПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Предупредить Тогда  
		Если ПустаяСтрока(Информация.ПолучитьТекст()) Тогда
			Сообщить("Не заполнен текст предупреждения!");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗапретНаОперацииВидОперацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекСтр = ТекущийЭлемент.ТекущиеДанные.НомерСтроки;
	
	Отбор = Новый Структура("ВидОперации", ВыбранноеЗначение);
	
	МассивПоиска = Объект.ЗапретНаОперации.НайтиСтроки(Отбор);
	
	Если МассивПоиска.Количество() > 0 Тогда
		Сообщить("Такая операция уже есть в списке.");
		Объект.ЗапретНаОперации.Удалить(ТекСтр - 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапретНаОперацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Элемент.ТекущиеДанные.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ПустаяСсылка") Тогда
		Объект.ЗапретНаОперации.Удалить(Элемент.ТекущиеДанные.НомерСтроки - 1);
	КонецЕсли;
КонецПроцедуры
